import numpy as np

t = 3/4   #최저점은 t= 1/4, #최고점은 t = 3/4
omega = 2 * np.pi

print("Triangle wave at t=1/4 (peak):")
print("=" * 70)
print("k  | n  | (-1)^k  | sin(nωt) |  /n²   | contribution")
print("---|----| ------- | ---------| -----  |-------------")

sum_val = 0
for k in range(1, 10):
    n = 2*k - 1
    sign = (-1)**k
    sin_val = np.sin(n * omega * t)  #omega = 2 * pi
    divided = sign * sin_val / (n**2)
    sum_val += divided 

    print(f"{k:2d} | {n:2d} | {sign:7d} | {sin_val:8.4f} | {1/n**2:6.4f} | {divided:12.6f}")
        # d : digit/decimal integer . 정수
        # f : float . 실수
        # {x:3d}  : "  5". 3칸. 오른쪽 정렬
        # {x:03d} : "005". 3칸. 0으로 채움
        # {y:f}   : "3.141690" 기본 6자리 채움

scaled = (8/np.pi**2) * sum_val #이렇게 scaling 해줘야 최대값이 1이 됨

print(f"\n합계 = {sum_val:.6f}")
print(f"8/π² 곱하면 = {scaled:.6f}")
print("=" * 70)

# 무한대로
sum_infinite = sum((-1)**k * np.sin((2*k-1) * omega *  t) / ((2*k-1)**2)
                    for k in range(1, 10000))
print(f"\n무한대(9999개) : {(8/np.pi**2) * sum_infinite:.10f}") 
    # 8/(np.pi)**2 를 해줘야 최고지점이 1과 비슷해짐




"""sine 기반 Triangle 에서

t = 0   -> 0도.   값 : 0 시작
t = 1/4 -> 90도.  값 : -1 (최저점) . 한 주기의 25% 위치
t = 1/2 -> 180도. 값 : 0
t = 3/4 -> 270도. 값 : +1 (최고점)
t = 1   -> 360도. 값 : 0

"""

"""cosine 기반 Triangle 에서는
t = 0 -> 0도. 값 : +1 (최고점) => 최대값에서 시작함
"""

"""
Triangle wave at t=1/4 (peak):
======================================================================
k  | n  | (-1)^k  | sin(nωt) |  /n²   | contribution
---|----| ------- | ---------| -----  |-------------
 1 |  1 |      -1 |  -1.0000 | 1.0000 |     1.000000
 2 |  3 |       1 |   1.0000 | 0.1111 |     0.111111
 3 |  5 |      -1 |  -1.0000 | 0.0400 |     0.040000
 4 |  7 |       1 |   1.0000 | 0.0204 |     0.020408
 5 |  9 |      -1 |  -1.0000 | 0.0123 |     0.012346
 6 | 11 |       1 |   1.0000 | 0.0083 |     0.008264
 7 | 13 |      -1 |  -1.0000 | 0.0059 |     0.005917
 8 | 15 |       1 |   1.0000 | 0.0044 |     0.004444
 9 | 17 |      -1 |  -1.0000 | 0.0035 |     0.003460

합계 = 1.205951
8/π² 곱하면 = 0.977507
======================================================================

무한대(9999개) : 0.9999797337 
"""